Repository: fathimathnasrin123-cell/SPRINT3
Catalog: lib/l10n/app_*.arb
Languages: ml

source: Settings
ml: ക്രമീകരണങ്ങൾ

source: Language
ml: ഭാഷ

source: Select Language
ml: ഭാഷ തിരഞ്ഞെടുക്കുക

source: Notifications
ml: അറിയിപ്പുകൾ

source: Logout
ml: പുറത്തുകടക്കുക

source: Login
ml: ലോഗിൻ

# appTitle
source: CareNow
ml: കെയർനൗ

source: Welcome Back
ml: സ്വാഗതം

source: Email
ml: ഇമെയിൽ

source: Password
ml: പാസ്‌വേഡ്

source: My Care
ml: എന്റെ പരിചരണം

source: Reset Password
ml: പാസ്‌വേഡ് പുനഃക്രമീകരിക്കുക

# checkEmail
source: Check your email
ml: നിങ്ങളുടെ ഇമെയിൽ പരിശോധിക്കുക

# sentRecoveryInstructions
source: We have sent password recovery instructions to your email.
ml: നിങ്ങളുടെ ഇമെയിലിലേക്ക് നിർദ്ദേശങ്ങൾ അയച്ചിട്ടുണ്ട്.

source: Back to Login
ml: ലോഗിനിലേക്ക് മടങ്ങുക

# enterEmailForReset
source: Enter your email address and we will send you a link to reset your password.
ml: പാസ്‌വേഡ് പുനഃക്രമീകരിക്കാൻ ഇമെയിൽ നൽകുക.

source: Email Address
ml: ഇമെയിൽ വിലാസം

source: Send Reset Link
ml: റീസെറ്റ് ലിങ്ക് അയയ്ക്കുക

source: Create Account
ml: അക്കൗണ്ട് സൃഷ്ടിക്കുക

source: Elderly
ml: മുതിർന്നവർ

source: Caregiver
ml: പരിചരിക്കുന്നവർ

source: Staff
ml: ജീവനക്കാർ

source: Complete Registration
ml: രജിസ്ട്രേഷൻ പൂർത്തിയാക്കുക

source: Full Name
ml: മുഴുവൻ പേര്

# simplifiedRegistration
source: Simplified Registration for Easy Access
ml: ലളിതമായ രജിസ്ട്രേഷൻ

# dobOptional
source: Date of Birth (Optional)
ml: ജനന തീയതി (നിർബന്ധമല്ല)

# linkToElderly
source: Link your account to an Elderly user
ml: മുതിർന്ന ഉപയോക്താവുമായി ലിങ്ക് ചെയ്യുക

# elderlyLinkId
source: Elderly Link ID / Code
ml: എൽഡർലി ലിങ്ക് ഐഡി

source: Relationship
ml: ബന്ധം

# adminApprovalRequired
source: Registration requires Admin Approval.
ml: അഡ്മിൻ അംഗീകാരം ആവശ്യമാണ്.

# staffId
source: Staff ID / Badge Number
ml: സ്റ്റാഫ് ഐഡി

source: Department
ml: വിഭാഗം

source: Welcome to CareNow
ml: കെയർനൗവിലേക്ക് സ്വാഗതം

# selectLanguagePrompt
source: Please select your preferred language to continue.
ml: തുടരാൻ ദയവായി നിങ്ങളുടെ ഭാഷ തിരഞ്ഞെടുക്കുക.

source: Medication
ml: മരുന്ന്

source: Appointments
ml: കൂടിക്കാഴ്ചകൾ

source: Emergency
ml: അത്യാഹിതം

source: Profile
ml: പ്രൊഫൈൽ

source: Dashboard for
ml: ഡാഷ്ബോർഡ്

source: Next Dose
ml: അടുത്ത ഡോസ്

source: Vitals
ml: വൈറ്റൽസ്

source: Staff Portal
ml: സ്റ്റാഫ് പോർട്ടൽ

source: Search Patient Records...
ml: രോഗി വിവരങ്ങൾ തിരയുക...

# forgotPasswordQuestion
source: Forgot Password?
ml: പാസ്‌വേഡ് മറന്നോ?

# createAccountQuestion
source: New here? Create an Account
ml: പുതിയ ആളാണോ? അക്കൗണ്ട് സൃഷ്ടിക്കുക

source: Username
ml: ഉപയോക്തൃനാമം

# usernameError
source: Please enter username
ml: ദയവായി ഉപയോക്തൃനാമം നൽകുക

source: User not registered
ml: ഉപയോക്താവ് രജിസ്റ്റർ ചെയ്തിട്ടില്ല

source: Incorrect password
ml: തെറ്റായ പാസ്‌വേഡ്

# emailAvailable
source: Email already available
ml: ഇമെയിൽ ഇതിനകം ലഭ്യമാണ്

source: Registration failed
ml: രജിസ്ട്രേഷൻ പരാജയപ്പെട്ടു

# unexpectedError
source: An unexpected error occurred
ml: അപ്രതീക്ഷിതമായ ഒരു പിശക് സംഭവിച്ചു

# uniqueId
source: My Unique ID
ml: എന്റെ യുണീക് ഐഡി

# elderlyMode
source: Elderly Mode (Large Text)
ml: മുതിർന്നവർക്കുള്ള മോഡ് (വലിയ അക്ഷരങ്ങൾ)

# elderlyModeDesc
source: Increases text size
ml: അക്ഷരങ്ങളുടെ വലിപ്പം കൂട്ടുന്നു

source: Change Password
ml: പാസ്‌വേഡ് മാറ്റുക

source: Current Password
ml: നിലവിലെ പാസ്‌വേഡ്

source: New Password
ml: പുതിയ പാസ്‌വേഡ്

source: Update
ml: അപ്ഡേറ്റ് ചെയ്യുക

source: Cancel
ml: റദ്ദാക്കുക

# passwordChanged
source: Password changed successfully
ml: പാസ്‌വേഡ് വിജയകരമായി മാറ്റി

source: Manage Linked Elderly
ml: ലിങ്ക് ചെയ്ത മുതിർന്നവരെ നിയന്ത്രിക്കുക

# linkedMsg
source: {count} / 5 linked
ml: {count} / 5 ലിങ്ക് ചെയ്തു

# noElderlyLinked
source: No elderly linked yet.
ml: ആരെയും ലിങ്ക് ചെയ്തിട്ടില്ല

# addElderlyId
source: Add Elderly ID (e.g. ELD-1234)
ml: എൽഡർലി ഐഡി ചേർക്കുക (ഉദാഹരണത്തിന് ELD-1234)

source: Add
ml: ചേർക്കുക

source: Close
ml: അടയ്ക്കുക

# limitReached
source: Limit of 5 reached
ml: 5 പേരെ മാത്രമേ ചേർക്കാൻ കഴിയൂ

# accountDisabled
source: Your account has been disabled. Contact Admin.
ml: നിങ്ങളുടെ അക്കൗണ്ട് പ്രവർത്തനരഹിതമാക്കി. അഡ്മിനെ ബന്ധപ്പെടുക.

# staffIdOnly
source: Staff ID
ml: സ്റ്റാഫ് ഐഡി

source: Condition
ml: അവസ്ഥ

source: Medicines
ml: മരുന്നുകൾ

source: Profile not found
ml: പ്രൊഫൈൽ കണ്ടില്ല

source: Search by Unique ID
ml: യുണീക് ഐഡി ഉപയോഗിച്ച് തിരയുക

source: Date of Birth
ml: ജനന തീയതി

# passwordHelper
source: Must contain at least 1 special char & 1 number
ml: കുറഞ്ഞത് 1 പ്രത്യേക ചിഹ്നവും 1 നമ്പറും വേണം

# caregiverFamily
source: Caregiver/Family Member
ml: പരിചരിക്കുന്നവർ/കുടുംബാംഗം

source: Volunteer
ml: വോളന്റിയർ

# ageEligibilityError
source: You are not eligible to register as an elderly user
ml: നിങ്ങൾ ഒരു മുതിർന്ന ഉപയോക്താവായി രജിസ്റ്റർ ചെയ്യാൻ യോഗ്യരല്ല

source: Medicine Timing
ml: മരുന്ന് സമയം

source: Volunteer Hub
ml: വോളന്റിയർ ഹബ്

source: Welcome, Volunteer!
ml: സ്വാഗതം, വോളന്റിയർ!

# thankYouVolunteer
source: Thank you for joining our community.
ml: ഞങ്ങളുടെ കമ്മ്യൂണിറ്റിയിൽ ചേർന്നതിന് നന്ദി.

source: View Available Tasks
ml: ലഭ്യമായ സേവനങ്ങൾ കാണുക

# noConditions
source: No conditions recorded
ml: രോഗവിവരങ്ങൾ ലഭ്യമല്ല

# noMedicines
source: No medicines recorded
ml: മരുന്ന് വിവരങ്ങൾ ലഭ്യമല്ല

# noTiming
source: No timing recorded
ml: സമയക്രമം ലഭ്യമല്ല

source: Confirm Password
ml: പാസ്‌വേഡ് സ്ഥിരീകരിക്കുക

source: Passwords do not match
ml: പാസ്‌വേഡുകൾ പൊരുത്തപ്പെടുന്നില്ല

source: Select Role
ml: റോൾ തിരഞ്ഞെടുക്കുക

source: Request Hospital Access
ml: ആശുപത്രി പ്രവേശനം അഭ്യർത്ഥിക്കുക

source: Access Requested
ml: പ്രവേശനം അഭ്യർത്ഥിച്ചു

source: Access Pending
ml: പ്രവേശനം കാത്തിരിക്കുന്നു

source: Access Approved
ml: പ്രവേശനം അനുവദിച്ചു

source: Access Rejected
ml: പ്രവേശനം നിരസിച്ചു

source: Approve
ml: അംഗീകരിക്കുക

source: Reject
ml: നിരസിക്കുക

source: Patient Requests
ml: രോഗികളുടെ അഭ്യർത്ഥനകൾ

source: Approved Patients
ml: അംഗീകൃത രോഗികൾ

source: My Details
ml: എന്റെ വിവരങ്ങൾ

source: Family Member
ml: കുടുംബാംഗം

# volunteerRegistrationSuccess
source: Volunteer registration submitted successfully
ml: വോളന്റിയർ രജിസ്ട്രേഷൻ വിജയകരമായി സമർപ്പിച്ചു

# volunteerAlert
source: Please review the volunteer guidelines
ml: ദയവായി വോളന്റിയർ മാർഗ്ഗനിർദ്ദേശങ്ങൾ പരിശോധിക്കുക

source: Request
ml: അഭ്യർത്ഥന

# joinVolunteer
source: Join as a Volunteer to help the community
ml: സമൂഹത്തെ സഹായിക്കാൻ വോളന്റിയർ ആയി ചേരുക

source: Send Request
ml: അഭ്യർത്ഥന അയയ്ക്കുക

source: Hospital Access
ml: ആശുപത്രി പ്രവേശനം

source: No ID
ml: ഐഡി ഇല്ല

source: Unknown
ml: അജ്ഞാതം

# notAvailable
source: N/A
ml: ലഭ്യമല്ല

source: User does not exist
ml: ഉപയോക്താവ് നിലവിലില്ല

# accountAlreadyLinked
source: Elderly Unit ID is already linked to another caregiver and cannot be reused, as one elderly can be connected to only one caregiver.
ml: അക്കൗണ്ട് ഇതിനകം ലിങ്ക് ചെയ്തിട്ടുണ്ട്

source: Live Queue
ml: തൽസമയ ക്യൂ

source: Now Serving
ml: ഇപ്പോൾ സേവിക്കുന്നു

source: Up Next
ml: അടുത്തത്

source: Waiting
ml: കാത്തിരിക്കുന്നു

source: Est. Time
ml: കണക്കാക്കിയ സമയം

source: Call Token
ml: ടോക്കൺ വിളിക്കുക

# complete
source: Completed
ml: പൂർത്തിയായി

source: No Active Queue
ml: സജീവ ക്യൂ ഇല്ല

# noActiveQueueDesc
source: Appointments for today will appear here.
ml: ഇന്നത്തെ കൂടിക്കാഴ്ചകൾ ഇവിടെ കാണാം.

source: All Done!
ml: എല്ലാം പൂർത്തിയായി!

source: Select Doctor
ml: ഡോക്ടറെ തിരഞ്ഞെടുക്കുക

source: Confirm Appointment
ml: കൂടിക്കാഴ്ച സ്ഥിരീകരിക്കുക

source: Doctor
ml: ഡോക്ടറുടെ പേര്

source: Date
ml: തീയതി

source: Confirm
ml: സ്ഥിരീകരിക്കുക

# appointmentBookedSuccess
source: Appointment booked successfully!
ml: കൂടിക്കാഴ്ച വിജയകരമായി ബുക്ക് ചെയ്തു!

source: Appointment Requests
ml: കൂടിക്കാഴ്ച അഭ്യർത്ഥനകൾ

source: No pending appointments.
ml: കാത്തിരിക്കുന്ന കൂടിക്കാഴ്ചകൾ ഇല്ല.

source: Patient ID
ml: രോഗിയുടെ ഐഡി

# activeTokenRestriction
source: You already have an active token. Please wait until it is completed or cancelled.
ml: നിങ്ങൾക്ക് ഇതിനകം ഒരു സജീവ ടോക്കൺ ഉണ്ട്. അത് പൂർത്തിയാക്കുന്നതുവരെ കാത്തിരിക്കുക.

source: Status
ml: അവസ്ഥ

source: Current Token
ml: നിലവിലെ ടോക്കൺ

source: Next Token
ml: അടുത്ത ടോക്കൺ

source: Waiting for Approval
ml: അംഗീകാരത്തിനായി കാത്തിരിക്കുന്നു

source: Appointment Approved
ml: കൂടിക്കാഴ്ച അംഗീകരിച്ചു

# queueNotActive
source: Queue details will appear after approval.
ml: അംഗീകാരത്തിന് ശേഷം ക്യൂ വിവരങ്ങൾ ലഭ്യമാകും.

source: Your Token
ml: നിങ്ങളുടെ ടോക്കൺ

source: Pending
ml: പെൻഡിംഗ്

source: Approved
ml: അംഗീകരിച്ചു

source: Rejected
ml: നിരസിച്ചു

source: Served
ml: സേവിച്ചു

# setToken
source: Set Token (1-100)
ml: ടോക്കൺ സജ്ജമാക്കുക

source: No appointment taken
ml: കൂടിക്കാഴ്ച എടുത്തിട്ടില്ല

# requestSentPending
source: Request sent â€“ Pending approval
ml: അഭ്യർത്ഥന അയച്ചു - അംഗീകാരത്തിനായി കാത്തിരിക്കുന്നു

source: Appointment rejected
ml: കൂടിക്കാഴ്ച നിരസിച്ചു

source: Appointment expired
ml: കൂടിക്കാഴ്ച കാലഹരണപ്പെട്ടു

source: Token
ml: ടോക്കൺ

source: Enable Notifications
ml: അറിയിപ്പുകൾ പ്രവർത്തനക്ഷമമാക്കുക

source: Disable Notifications
ml: അറിയിപ്പുകൾ നിർജ്ജീവമാക്കുക

source: Notifications Enabled
ml: അറിയിപ്പുകൾ സജീവമാണ്

source: Notifications Disabled
ml: അറിയിപ്പുകൾ നിർജ്ജീവമാണ്

# alreadyLinkedByYou
source: You have already linked this Elderly ID.
ml: നിങ്ങൾ ഈ മുതിർന്ന ഐഡി ഇതിനകം ലിങ്ക് ചെയ്തിട്ടുണ്ട്.

source: Location
ml: സ്ഥലം

source: Location Not Available
ml: സ്ഥലം ലഭ്യമല്ല

source: Location Permission Denied
ml: ലൊക്കേഷൻ അനുമതി നിരസിച്ചു

source: Emergency Alert Sent!
ml: അടിയന്തര സന്ദേശം അയച്ചു!

source: Emergency for
ml: അടിയന്തരാവസ്ഥ

source: Active Appointment
ml: സജീവ കൂടിക്കാഴ്ച

# pleaseWaitForCompletion
source: Please wait for this appointment to complete.
ml: ദയവായി ഈ കൂടിക്കാഴ്ച പൂർത്തിയാകുന്നതുവരെ കാത്തിരിക്കുക.

source: Book Appointment
ml: കൂടിക്കാഴ്ച ബുക്ക് ചെയ്യുക

source: Emergency Confirmation
ml: അടിയന്തര സ്ഥിരീകരണം

# confirmEmergency
source: Are you sure you want to raise an emergency alert?
ml: നിങ്ങൾക്ക് അടിയന്തര സേവനം ആവശ്യമുണ്ടെന്ന് ഉറപ്പാണോ?

# emergencyDisclaimer
source: Once confirmed, your emergency call will be forwarded to the hospital and staff portal immediately.
ml: സ്ഥിരീകരിച്ചുകഴിഞ്ഞാൽ, വിവരം ഉടൻ തന്നെ ആശുപത്രിയിലും സ്റ്റാഫ് പോർട്ടലിലും ലഭിക്കും.

# confirmEmergencyFor
source: Are you sure you want to raise an emergency alert for {name}?
ml: {name} എന്ന രോഗിക്ക് അടിയന്തര സഹായം ആവശ്യമുണ്ടെന്ന് ഉറപ്പാണോ?

source: Emergency for Patient
ml: രോഗിക്ക് വിസമ്മതം

# emergencyAlertSentFor
source: Emergency Alert Sent for {name}!
ml: {name}-ന് അടിയന്തര സന്ദേശം അയച്ചു!

# emergencyAlertTitle
source: EMERGENCY ALERT
ml: അടിയന്തര മുന്നറിയിപ്പ്

# patientLabel
source: Patient
ml: രോഗി

# unitIdLabel
source: Unit ID
ml: യൂണിറ്റ് ഐഡി

# timeLabel
source: Time
ml: സമയം

# locationLabel
source: Location
ml: സ്ഥലം

source: ACCEPT
ml: സ്വീകരിക്കുക

# rejectAction
source: REJECT
ml: നിരസിക്കുക

# emergencyCount
source: Alert {current} of {total}
ml: അലേർട്ട് {current} / {total}

# okAction
source: OK
ml: ശരി

source: Notification Settings
ml: അറിയിപ്പ് ക്രമീകരണങ്ങൾ

# enableNotificationsDesc
source: Turn on/off all notifications
ml: എല്ലാ അറിയിപ്പുകളും ഓൺ/ഓഫ് ചെയ്യുക

source: Alert Preferences
ml: അലേർട്ട് മുൻഗണനകൾ

source: Sound
ml: ശബ്ദം

source: Vibration
ml: വൈബ്രേഷൻ

source: Token Queue Alerts
ml: ടോക്കൺ ക്യൂ അലേർട്ടുകൾ

# tokenAlertThresholdDesc
source: Notify me when my turn is within:
ml: എന്റെ ടോക്കൺ അടുക്കുമ്പോൾ അറിയിക്കുക:

source: tokens
ml: ടോക്കണുകൾ

source: Smart Reminders
ml: സ്മാർട്ട് ഓർമ്മപ്പെടുത്തലുകൾ

source: Appointment Reminders
ml: കൂടിക്കാഴ്ച ഓർമ്മപ്പെടുത്തലുകൾ

# appointmentRemindersDesc
source: Get notified before scheduled appointments
ml: ഷെഡ്യൂൾ ചെയ്ത കൂടിക്കാഴ്ചകൾക്ക് മുമ്പ് അറിയിക്കുക

source: Medicine Reminders
ml: മരുന്ന് ഓർമ്മപ്പെടുത്തലുകൾ

# medicineRemindersDesc
source: Reminders to take your daily medication
ml: ദിവസേനയുള്ള മരുന്ന് ഓർമ്മപ്പെടുത്തലുകൾ

# notificationsDisabledMsg
source: Notifications are currently disabled. Enable them to configure preferences.
ml: അറിയിപ്പുകൾ നിലവിൽ നിർജ്ജീവമാണ്. ക്രമീകരണങ്ങൾക്കായി അവ പ്രവർത്തനക്ഷമമാക്കുക.

# sosSentWaiting
source: Request sent, awaiting staff approval.
ml: അഭ്യർത്ഥന അയച്ചു, ജീവനക്കാരുടെ അംഗീകാരത്തിനായി കാത്തിരിക്കുന്നു.

# helpOnTheWay
source: Approved, help or vehicle is on the way
ml: അംഗീകരിച്ചു, സഹായമോ വാഹനമോ വരുന്നു

source: Emergency Resolved.
ml: അടിയന്തരാവസ്ഥ പരിഹരിച്ചു.

# emergencyClosed
source: Emergency Request Closed.
ml: അടിയന്തര അഭ്യർത്ഥന അടച്ചു.

# helpAccepted
source: Approved, help or vehicle is on the way
ml: അംഗീകരിച്ചു, സഹായമോ വാഹനമോ വരുന്നു

# msgClearTimer
source: Message will clear in {minutes} mins.
ml: {minutes} മിനിറ്റിനുള്ളിൽ സന്ദേശം മാറും.

source: SILENCE ALARM
ml: അലാറം നിർത്തുക

source: VIEW
ml: കാണുക

# activeEmergencies
source: {count} Emergency Request(s) Active!
ml: {count} അടിയന്തര അഭ്യർത്ഥനകൾ സജീവമാണ്!

source: STOP SOUND
ml: ശബ്ദം നിർത്തുക

# upNextAlert
source: You are next
ml: നിങ്ങൾ അടുത്തതാണ്

source: Patient Name
ml: രോഗിയുടെ പേര്

source: Code
ml: കോഡ്

source: Waiting for GPS...
ml: GPS-നായി കാത്തിരിക്കുന്നു...

# locationTimeout
source: Location timed out
ml: ലൊക്കേഷൻ സമയം കഴിഞ്ഞു

source: Address not found
ml: വിലാസം കണ്ടെത്തിയില്ല

# openMaps
source: Open in Maps
ml: മാപ്പിൽ തുറക്കുക

source: ACCEPT SOS
ml: അംഗീകരിക്കുക

source: Triggered By
ml: അറിയിച്ചത്

source: Loading...
ml: ലഭ്യമാക്കുന്നു...

# unableToFetchLocation
source: Unable to fetch location details
ml: ലൊക്കേഷൻ വിവരങ്ങൾ ലഭ്യമാക്കാൻ കഴിയില്ല

# reasonDoctorUnavailable
source: Doctor unavailable
ml: ഡോക്ടർ ലഭ്യമല്ല

# reasonSlotFull
source: Slot full
ml: സ്ലോട്ട് നിറഞ്ഞു

# reasonIncompleteDetails
source: Incomplete details
ml: അപൂർണ്ണമായ വിവരങ്ങൾ

# reasonReschedule
source: Reschedule required
ml: വീണ്ടും ഷെഡ്യൂൾ ചെയ്യേണ്ടതുണ്ട്

# reasonEmergencyPriority
source: Emergency case priority
ml: അടിയന്തര കേസ് മുൻഗണന

# reasonOther
source: Other (Type below)
ml: മറ്റുള്ളവ (താഴെ രേഖപ്പെടുത്തുക)

# reasonLabel
source: Reason:
ml: കാരണം:

# rejectionReasonHint
source: Enter specific reason...
ml: കാരണം രേഖപ്പെടുത്തുക...

# rejectAppointmentTitle
source: Reject Appointment
ml: അപ്പോയിന്റ്മെന്റ് നിരസിക്കുക

source: Please reschedule.
ml: ദയവായി വീണ്ടും ഷെഡ്യൂൾ ചെയ്യുക.
